In [1]:
import pandas as pd

# Load dataset
df = pd.read_csv("C:/Users/lenovo/Downloads/employee_dataset.csv")

print(df.head())

   EmpID        Name  Age  Gender Department   Salary JoiningDate  \
0      1  Employee_1   50  Female      Sales  90000.0  2015-01-01
1      2  Employee_2   36    Male    Finance  62500.0  2015-01-02
2      3  Employee_3   29    Male    Finance  39500.0  2015-01-03
3      4  Employee_4   42    Male      Sales  35000.0  2015-01-04
4      5  Employee_5   40    Male    Finance  41500.0  2015-01-05

   PerformanceScore  WorkHours
0               3.0       43.0
1               2.0       54.0
2               1.0       54.0
3               4.0       37.0
4               4.0       37.0

In [5]:
df.isnull().sum()

EmpID                 0
Name                  0
Age                   0
Gender                0
Department            0
Salary                5
JoiningDate           0
PerformanceScore    177
WorkHours            37
dtype: int64

In [7]:
df.dropna()

,EmpID,Name,Age,Gender,Department,Salary,JoiningDate,PerformanceScore,WorkHours
0,1,Employee_1,50,Female,Sales,90000.0,2015-01-01,3.0,43.0
1,2,Employee_2,36,Male,Finance,62500.0,2015-01-02,2.0,54.0
2,3,Employee_3,29,Male,Finance,39500.0,2015-01-03,1.0,54.0
3,4,Employee_4,42,Male,Sales,35000.0,2015-01-04,4.0,37.0
4,5,Employee_5,40,Male,Finance,41500.0,2015-01-05,4.0,37.0
...,...,...,...,...,...,...,...,...,...
995,996,Employee_996,34,Female,HR,31000.0,2017-09-22,2.0,36.0
996,997,Employee_997,51,Female,IT,56500.0,2017-09-23,1.0,44.0
997,998,Employee_998,44,Male,Finance,98000.0,2017-09-24,4.0,51.0
998,999,Employee_999,40,Female,Sales,64500.0,2017-09-25,1.0,53.0
999,1000,Employee_1000,53,Female,Sales,86000.0,2017-09-26,5.0,40.0

In [8]:
df.duplicated().sum()

np.int64(0)

In [11]:
data = {
    'Name': ['A', 'B', 'C', 'Lavika'],
    'Score': [90, None, 75, None]
}

df2 = pd.DataFrame(data)
print("Before:\n", df2)

df2['Score'].fillna(df2['Score'].mean(), inplace=True)
print("\nAfter Filling NaN:\n", df2)

Before:
      Name  Score
0       A   90.0
1       B    NaN
2       C   75.0
3  Lavika    NaN

After Filling NaN:
      Name  Score
0       A   90.0
1       B   82.5
2       C   75.0
3  Lavika   82.5

C:\Users\lenovo\AppData\Local\Temp\ipykernel_14316\3609439884.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Score'].fillna(df2['Score'].mean(), inplace=True)

In [14]:
data = {
    'Name': ['Arohi', 'Sharayu', 'Harshu', 'Dipali', 'Shipra'],
    'Class': ['X', 'X', 'Y', 'Y', 'X'],
    'Marks': [85, 90, 78, 88, 95]
}

df3 = pd.DataFrame(data)
print(df3.groupby('Class')['Marks'].mean())

Class
X    90.0
Y    83.0
Name: Marks, dtype: float64

In [16]:
import pandas as pd

data = {
    'Department': ['IT','IT','CS','CS','EC','EC','IT','CS'],
    'Student': ['Nikita','Kinjal','Lavika','Meena','Shambhu','Neha','Avani','Sita'],
    'Marks': [88,92,76,85,95,90,88,72],
    'Age': [21,20,23,22,21,20,22,24]
}

df = pd.DataFrame(data)
print(df)

  Department  Student  Marks  Age
0         IT   Nikita     88   21
1         IT   Kinjal     92   20
2         CS   Lavika     76   23
3         CS    Meena     85   22
4         EC  Shambhu     95   21
5         EC     Neha     90   20
6         IT    Avani     88   22
7         CS     Sita     72   24

In [17]:
df.groupby('Department')['Marks'].mean()

Department
CS    77.666667
EC    92.500000
IT    89.333333
Name: Marks, dtype: float64

In [18]:
df.groupby('Department')['Marks'].agg(['mean','max','min','count'])

                 mean  max  min  count
Department
CS          77.666667   85   72      3
EC          92.500000   95   90      2
IT          89.333333   92   88      3